Tekla.Structures.Model.RebarEndDetailModifier
The RebarEndDetailModifier class represents a modifier that can modify the characteristics of Tekla.Structures.Model.RebarSet reinforcing bars that pass through it.
It can modify reinforcing bar end properties and will therefore affect the end of the reinforcing bars it is nearest to.
The following example shows how to create and add a RebarEndDetailModifier, to a rebarset.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
// Create and insert a rebarset (see the RebarSet example).
var rebarSet = new RebarSet();
// Create the RebarEndDetailModifier.
var strip = new RebarEndDetailModifier();
strip.Father = rebarSet;
strip.RebarHook.Shape = RebarHookData.RebarHookShapeEnum.HOOK_90_DEGREES;
strip.RebarThreading.ThreadingType = "ThreadingType1";
strip.RebarThreading.Length = 100;
strip.RebarThreading.ExtraFabricationLength = 50;
strip.Curve.AddContourPoint(new ContourPoint(new Point(0, 200, 500), null));
strip.Curve.AddContourPoint(new ContourPoint(new Point(0,1000, 500), null));
strip.Insert();
}
}